[
    {
        "id": 1,
        "name": "cranial-sacral-therapy",
        "headerImage": "../services-images/cranial-sacral-therapy.jpeg",
        "title": "Cranial Sacral Therapy",
        "html": "<div><div><p>Cranial Sacral Therapy (craniosacral therapy) is a light-touch modality that taps into the subtle flexion and extension of the skeletal system, cerebral spinal fluid movement, and the nervous system. The practitioner supports the body's self-healing regulatory system with a sophisticated hands-on method restoring balance.</p><p><strong>Founding Principles:</strong></p><ul><li><p>The Body is a unit</p></li><li><p>The body has the innate ability to regulate and heal its self</p></li><li><p>Structure and function are reciprocally interrelated</p></li><li><p>A rational treatment regimen is based on these principles</p></li></ul><p>My personal experience with Cranial Sacral Therapy (craniosacral therapy) was life-changing. For the first time in my life I felt that the causal point of discord in my body was addressed and released. After only six once-a-week sessions I felt fundamentally changed at<strong>the core of my being</strong>. As I continue my journey giving and receiving Cranial Sacral (craniosacral) the mysteries and blessing of this gift continue to unfold.</p><br /></div></div><div><div><img src='../services-images/cranial-sacral-therapy-2.jpeg' alt='cranial sacral'/></div><div><div><h2><strong>What To Expect:</strong></h2><p>The client is fully clothed and lying comfortably on the treatment table. The practitioner lays<strong>very light hands-on the treatment</strong>area. This is generally comfortable and relaxing, although body sensations and emotions may arise.</p><p><strong>Benefits:</strong></p><ul><li><p>Healing, alleviating a range of illness and dysfunction, including chronic pain, central nervous system disorders, head and neck pain, TMJ dysfunction, fibromyalgia, chronic fatigue, seizure disorders, hormonal imbalances, chronic sinusitis, and more</p></li><li><p>Improved functioning of the autonomic nervous system, enabling the body to respond more effectively to stress</p></li><li><p>Improved immune system function</p></li><li><p>Release of tissue and bone restrictions, improving mobility</p></li><li><p>Tension release</p></li><li><p>Pain alleviation</p></li><li><p>Energy flow</p></li><li><p>Overall relaxation and revitalization</p></li></ul></div></div></div>"
    },
    {
        "id": 2,
        "name": "signature-massage",
        "headerImage": "../services-images/signature-massage.jpeg",
        "title": "Signature Massage",
        "html": "<div> <p>Are you struggling with sore muscles, limited mobility, or joint pain and are ready to let the stress and tension melt from your body so you can get back to being present to your life?</p><p>I specialize in working with extra sensitive humans who need more than a “standard massage” that typically focuses mainly  on the physical aspect of a Human Being. I strive to create a Holistic experience where each client is able to process physically, mentally, emotionally, and energetically. We separate the topics for the sake of discussion yet they are interwoven and one cannot be touched with impacting the other. </p><p>I work with my clients to meet them where they are, without judgment and from a place of least resistance. Healing comes from with-in and from one body’s own innate healing process. It is my goal to align our healing goals and follow your body’ s healing protocol each session. </p><p>This is far from your average massage. This is a beautiful blend of therapeutic. massage, cranial sacral therapy, intuition, and client/practitioner healing collaboration. </p><p><strong>Some wonderful benefits of massage are…</strong></p><ul><li><p>Improved circulation.</p></li><li><p>Decreased muscle stiffness.</p></li><li><p>Decreased joint inflammation.</p></li><li><p>Better quality of sleep.</p></li><li><p>Quicker recovery between workouts.</p></li><li><p>Improved flexibility.</p></li><li><p>Less pain and soreness.</p></li><li><p>Strengthened immune response.</p></li><li><p>Helps reduce cortisol levels.</p></li><li><p>Increases serotonin and dopamine naturally</p></li><li><p>Lower stress, decrease anxiety, and reduce irritability.</p></li><li><p>Improves Sleep</p></li><li><p>Relieves Symptoms of Depression.</p></li><li><p>Promote feelings of wellbeing and connection. ...</p></li><li><p>Lowered Stress Levels. ...</p></li><li><p>Feel Fresh and Energized</p></li><li><p>Calm Your Mind and improves mental health. </p></li></ul><p><strong>Who is the Signature Session for?</strong></p><p>Empaths: Highly sensitive, absorb other people's energy, introverted, highly intuitive, easily overwhelmed or drained by other people's energy. </p><p>Service Providers: Teacher, Hospitality, Fitness, Finance, Media, ex. </p><p>Caretakers: Moms, Nurses, Hospice support, Nanny. </p><p>Other Practitioners: Doctor, Acupuncturist, CMT, Chiropractor, OBGYN, Veterinarian, LMFT, Healer, Physic, ex. </p><p>CEO’s with high pressure work and struggle with family life, health, and golf performance balance. </p><p><strong>'…</strong></p><p>I  am a Holistic  Massage Practitioner, Cranial Sacral Therapist, and Yoga Instructor serving San Diego county for the last 7 years. After 15 years of living an unbalanced lifestyle  in the hospitality industry I left my waitressing job in 2015  to pursue a career in the holistic field to help others overcome burnout, chronic fatigue, and chronic pain. I was out of alignment physically, mentally, emotionally, and needing to make a big change in my life. I use my personal and professional experiences in transforming chronic pain, injury, and stress into a healing path forward. By resolving physical, mental and emotional restrictions and creating a clear, healthy communication with all aspects of self we can make a happy home within ourselves. <strong> </strong></p><p><strong>What to expect: </strong></p><p>Upon booking you will receive an online intake form to fill out prior to your first visit. On your first visit we will go over the intake form together and create a customized plan for your session(s) based on your needs and goals.</p><p>Each session is custom to your needs, but in general, our session(s)  include  a blend of massage styles and modalities including Swedish, Trigger Point, Deep Tissue, Silicon Cupping, and Graston Tool Technique. This massage also weaves in Cranial Sacral Therapy Technique and Various Energy Healing Techniques, as well as, Sound Healing Elements. </p><p>Before the Signature Massage the client will disrobe to their comfortability and lie aligned on the massage table underneath fresh white linens and a cozy blanket. The massage is covered with a memory foam pad and face cradle, and a full body heating pad for maximum comfort. Clients will start face up or down depending on the client's prior discussion. </p><p>I use Grapeseed Oil for sensitive skin. Grapeseed Oil is rich in vitamins A, E, B, D plus amino acids, and Antioxidants. I love it because it is lightweight yet glides well and is long lasting. This is an excellent medium for silicone cupping and Graston tools. </p><p>We will be in communication throughout the massage. The amount of communication is dependent on each individual preference and style of process/detox. </p><p>After the massage expect to feel balanced, aligned, and reset. Allow for time to rest and integrate the session. A deep reset is experienced differently by everyone. Some people feel immediately revitalized, some need more time to ground and settle back into their body, or some may need lots of rest to complete detox and integration. Plan for 24-48hrs to allow the session to integrate. If possible avoid high stress situations, working out to sweat, running, or hurrying back to life to do list. </p> </div>"
    },
    {
        "id": 3,
        "name": "yoga-session",
        "headerImage": "../services-images/yoga-session.jpeg",
        "title": "Yoga Session",
        "html": "<div><p>Are you struggling with back pain, mobility issues, or trauma, and you're ready to get back into a routine and feel good in your body again?</p><p>Each yoga session is custom built for your individual needs. My goal is to help apply a yoga practice in a practical way that works for your body. We make yoga that works for your body, not your body work for yoga.</p><p>My yoga teaching style brings a distinct sense of self-empowerment and peace of mind through a combination of powerful movement, breathing practices, and meditation. My focus is on using the breath and visualization to enhance a release, increase body awareness and one's ability to respond with compassion to the body's needs.</p><p>Gentle trauma-conscious yoga calms the nervous system and gently releases emotional and physical trauma trapped in the body. <em>Together we will go on a journey of building a trusting relationship that… Through your yoga journey, we'll work together to help you build a trusting relationship and feel more at home in your own body.</em></p><p><strong>Some wonderful benefits of yoga are…</strong></p><ul><li>Reduces stress and anxiety.</li><li>Improves respiration, energy and vitality.</li><li>Improves energy, focus and mood.</li><li>Increases interpersonal relationships</li><li>Creates safety in the body.</li><li>Increase sense of connection with spirituality and self.</li><li>Improves cardiovascular health.</li><li>Improves athletic performance.</li><li>Healthy metabolism.</li></ul><p></p><p><strong>Who are private yoga sessions for?</strong></p><p>You prefer 1:1 focused attention with custom yoga fit to your body's needs.</p><p>You want to get back in touch with your body.</p><p>You want to heal your body, inside and out, and get back to doing the things that mean the most to you.</p><p>You have suffered with or witnessed mental, emotional, or physical trauma.</p><p>You're active but you struggle with mobility issues and/or pain, and are looking to keep your body healthy with a better balance.</p><p>You are a golfer suffering from low back pain and want to improve mobility.</p></div>"
    },
    {
        "id": 4,
        "name": "assisted-deep-stretch",
        "headerImage": "../services-images/assisted-deep-stretch.jpeg",
        "title": "Assisted Deep Stretch",
        "html": "<div><p>Are you struggling with tight muscles, restricted mobility, and joint pain and ready to take a step forward in optimizing your health?</p><p>Gentle yet deep assisted stretching will help to reduce the risk of injuries, regain mobility, improve flexibility, improve range of motion. I will provide assistance in proper form, depth, length, and breath of a custom stretch sequence designed for your body’s needs. Using the techniques above we will cultivate a loving line of communication with your body.</p><p><strong>Some wonderful benefits of Session are...</strong></p><ul><li>Increased flexibility</li><li>Increased range of motion</li><li>Increased blood flow</li><li>Improved posture</li><li>Injury prevention</li><li>Stress relief</li><li>Mental clarity</li><li>Decreased tension headaches</li><li>Sense of personal freedom</li></ul><p><strong>Who are these private sessions for?</strong></p><p>You prefer a custom stretch fit to your body’s needs.</p><p>You prefer not to be in a group.</p><p>Your goal for stretching is getting back in touch with your body.</p><p>Your goal for stretching is healing and getting back to the things that mean most to you in your life.</p><p>You have suffered with or witnessed mental, emotional, or physical trauma.</p><p>You play a physically demanding sport and need a counter balance cross training that keeps your body healthy.</p><p>You are a golfer suffering from low back pain and want to improve mobility.</p><p>You have been sitting at a desk for too long and your body is begging for a deep stretch, more mobility, and range of motion.</p><p><strong>About me…</strong></p><p>I am a Holistic Massage Practitioner, Cranial Sacral Therapist, and Yoga Instructor serving San Diego county for the last 7 years. After 15 years of living an unbalanced lifestyle in the hospitality industry I left my waitressing job in 2015 to pursue a career in the holistic field to help others overcome burnout, chronic fatigue, and chronic pain. I was out of alignment physically, mentally, emotionally, and needing to make a big change in my life. I use my personal and professional experiences in transforming chronic pain, injury, and stress into a healing path forward. By resolving physical, mental and emotional restrictions and creating a clear, healthy communication with all aspects of self we can make a happy home within ourselves.</p></div>"
    },
    {
        "id": 5,
        "name": "guided-breathwork-session",
        "headerImage": "../services-images/guided-breathwork-session.jpeg",
        "title": "Guided Breathwork Session",
        "html": "<div><div><p>Are you struggling with feeling stuck, stagnant, and emotionally overwhelmed and ready to experience mental, physical, and emotional freedom?</p><p>Each breathwork session is custom built for your individual needs. My goal is to help apply a breathwork practice in a practical way that works for your body. Guided breathwork is incredibly powerful and can help reverse chest breathing, process emotional blockages, reduce anxiety and stress, and increase wellbeing and joy.</p><p>Over the last ten years, I have blended various breath techniques together to create my own personal style healing breathwork. I incorporate sound healing, visualization, and yoga nidra in the transformational sessions.</p><p><strong>Some wonderful benefits of breathwork are...</strong></p><ul><li><p>Reduces stress and anxiety.</p></li><li><p>Increases energy and boosts immunity.</p></li><li><p>Lowers blood pressure and improves circulation.</p></li><li><p>Helps manage pain.</p></li><li><p>Strengthens lungs.</p></li><li><p>Improves mood and self-esteem.</p></li><li><p>Releases toxins.</p></li><li><p>Improves sleep.</p></li><li><p>Balanced blood pressure.</p></li><li><p>More time in deep sleep.</p></li><li><p>Reduction of PTSD and feelings of trauma.</p></li><li><p>Stronger respiratory function.</p></li><li><p>Better immune system.</p></li><li><p>Release of stress hormones from your body.</p></li></ul><p><strong>Who are breathwork sessions for?</strong></p><p>Empaths: Highly sensitive, absorb other people’s energy, introverted, highly intuitive, easily overwhelmed or drained by other people’s energy.</p><p>You have a vivid imagination, enjoy astral projection, and daydreaming.</p><p>You are going through the stages of grief or have unresolved grief.</p><p>Service Providers: Teacher, Hospitality, Fitness, Finance, Media, ex.</p><p>Caretakers: Moms, Nurses, Hospice support, Nanny.</p><p>Other Practitioners: Doctor, Acupuncturist, CMT, Chiropractor, OBGYN, Veterinarian, LMFT, Healer, Physic, ex.</p><p>CEO’s with high pressure work and struggle with family life, health, and golf performance balance.</p><p><strong>About me..</strong></p><p>I am a Holistic Massage Practitioner, Cranial Sacral Therapist, and Yoga Instructor serving San Diego county for the last 7 years. After 15 years of living an unbalanced lifestyle in the hospitality industry I left my waitressing job in 2015 to pursue a career in the holistic field to help others overcome burnout, chronic fatigue, and chronic pain. I was out of alignment physically, mentally, emotionally, and needing to make a big change in my life. I use my personal and professional experiences in transforming chronic pain, injury, and stress into a healing path forward. By resolving physical, mental and emotional restrictions and creating a clear, healthy communication with all aspects of self we can make a happy home within ourselves. </p><p><strong>What to expect:</strong></p><p>Upon booking you will receive an online intake form to fill out prior to your first visit. On your first visit we will go over the intake form together and create a customized plan for your session(s) based on your needs and goals.</p><p>Each session is custom to your needs, but in general, our session(s) include intention setting, breathwork, vocal toning, and localized movement. We finish each practice with a Yoga Nidra meditation and crystal bowl sound healing for balance and integration.</p><p>Wear comfortable clothes that allow for movement and relaxation. Client remains fully clothed, shoes are optional.</p><p>Client will lay down on a padded floor mat face up. I will guide you through the various breathing techniques, visualizations, and meditation. This guidance will be weaved with sound healing and gentle body mapping to release stagnant energy or holding patterns.</p><p>After the breathwork session, you can expect to feel clear, balanced, and more invigorated. Allow time to rest and integrate after the session. A deep reset is experienced differently by everyone. Plan for 24-48hrs to allow for integration. If possible avoid high stress situations, working out to sweat, running, or hurrying back to life to do list.</p></div></div>"
    },
    {
        "id": 6,
        "name": "chakra-balancing-energy-healing",
        "headerImage": "../services-images/chakra-balancing-energy-healing.jpeg",
        "title": "Chakra Balancing Energy Healing",
        "html": "<div><p>Are you struggling with inconsistent or low energy, feelings of confusion and making healthy changes in your life?</p><p>Energy Healing is a powerful, non-invasive treatment to align and balance the chakra system. Energy work encompasses a wide range of techniques and practices. It is rooted in the principle that the body is bioenergetic and seeks to maintain balance. Energy healing, or energy work, seeks to restore, promote, and maintain health and wellness to all those elements by influencing and supporting the body’s bioenergies.</p><p>Together we will walk through the energetic body clearing, rebalancing, and reprogramming the entire chakra system and auric field.</p><p>Using tools, such as, Sage, palo Santos, feathers, shamanic rattle, crystal bowl sound heal and chanting are generally incorporated into the session in accordance to the individuals needs and preferences.</p><p><strong>Some wonderful benefits of Energy Healing are...</strong></p><ul><li><p>Improved overall health and well being.</p></li><li><p>Greater and faster ability to heal your mental, physical, spiritual and emotional issues.</p></li><li><p>Increased openness, memory, concentration and awareness.</p></li><li><p>Positive outlook in terms of understanding, perception of behaviors and thought process.</p></li><li><p>Heightened creativity and better resourcefulness because of better perception.</p></li><li><p>Sense of self-worth, self-esteem and self- confidence.</p></li><li><p>Improved and deeper sleep.</p></li><li><p>Better clarity and control over your emotions</p></li><li><p>Improved patience.</p></li></ul><p></p><p><strong>Who are these Energy Healing Sessions for?</strong></p><p>Empaths: Highly sensitive, absorb other people's energy, introverted, highly intuitive, easily overwhelmed or drained by other people's energy.</p><p>You have a vivid imagination, enjoy astral projection, and daydreaming.</p><p>You are going through the stages of grief or have unresolved grief.</p><p>You feel bogged down, overwhelmed, and/or confused about how to move forward.</p><p>You feel spiritually blocked, ungrounded, and/or at a crossroads.</p><p>You have an upcoming event, big conversation, or life transition that you want to feel optimized mentally, physically, emotionally, and spiritually for.</p><p><strong>About me…</strong></p><p>I am a Holistic Massage Practitioner, Cranial Sacral Therapist, and Yoga Instructor serving San Diego county for the last 7 years. After 15 years of living an unbalanced lifestyle in the hospitality industry I left my waitressing job in 2015 to pursue a career in the holistic field to help others overcome burnout, chronic fatigue, and chronic pain. I was out of alignment physically, mentally, emotionally, and needing to make a big change in my life. I use my personal and professional experiences in transforming chronic pain, injury, and stress into a healing path forward. By resolving physical, mental and emotional restrictions and creating a clear, healthy communication with all aspects of self we can make a happy home within ourselves. </p><p><strong>What to Expect…</strong></p><p>Upon booking you will receive an online intake form to fill out prior to your first visit. On your first visit we will go over the intake form together and create a customized plan for your session(s) based on your needs and goals.</p><p>Each session is custom to your needs, but in general, our session(s) include intention setting, breathwork, and movement. Client will lay face up on the massage table for the session. We finish each practice with a Yoga Nidra meditation and crystal bowl sound healing for balance and integration.</p><p>Wear comfortable clothes that allow for movement.</p><p>After the session, you can expect to feel clear, balanced, and more invigorated. Allow time to rest and integrate after the session.</p></div>"
    },
    {
        "id": 7,
        "name": "guided-meditation",
        "headerImage": "../services-images/guided-meditation.jpeg",
        "title": "Guided Meditation",
        "html": "<div><p>Are you struggling with brain fog, anxiety, and/or inability to focus and are ready to get clarity and confidence in the flow of life?</p><p>Each meditation session is custom built for your individual needs. My goal is to help apply a meditation practice in a practical way that works for your lifestyle.</p><p>My meditation teaching style brings a distinct sense of self-empowerment and peace of mind through a combination of powerful visualization, breathing practices, and sound. My focus is on using the breath and visualization to enhance a release, increase body awareness and one's ability to respond with compassion to the body's needs.</p><p>Meditation calms the nervous system and gently releases metal, emotional and physical stress trapped in the body. There are many styles of meditation, together we will create a meditation practice that is enjoyable and sustainable for your lifestyle.</p><p><strong>Some wonderful benefits of meditation are…</strong></p><ul><li><p>Increases clarity</p></li><li><p>Increases intuition</p></li><li><p>Reduces stress and anxiety.</p></li><li><p>Improves respiration, energy and vitality.</p></li><li><p>Improves energy, focus and mood.</p></li><li><p>Increases interpersonal relationships</p></li><li><p>Creates safety in the body.</p></li><li><p>Increases creativity</p></li><li><p>Efficient way to obtain sleep.</p><p></p></li></ul><p><strong>Who are private meditation sessions for?</strong></p><p>You prefer custom 1:1 work.</p><p>You struggle with staying grounded and focused.</p><p>You can’t quiet mind chatter..(Monkey Mind.)</p><p>You want to get back in touch with your body.</p><p>You want to heal your body, inside and out, and get back to doing the things that mean the most to you.</p><p>You have suffered with or witnessed mental, emotional, or physical trauma.</p><p>You’re active but you struggle with mobility issues and/or pain, and are looking to keep your body healthy with a better balance.</p><br><p><strong>About me</strong></p><p>I am a Holistic Massage Practitioner, Cranial Sacral Therapist, and Yoga Instructor serving San Diego county for the last 7 years. After 15 years of living an unbalanced lifestyle in the hospitality industry I left my waitressing job in 2015 to pursue a career in the holistic field to help others overcome burnout, chronic fatigue, and chronic pain. I was out of alignment physically, mentally, emotionally, and needing to make a big change in my life. I use my personal and professional experiences in transforming chronic pain, injury, and stress into a healing path forward. By resolving physical, mental and emotional restrictions and creating a clear, healthy communication with all aspects of self we can make a happy home within ourselves.</p><br><p><strong>What to expect:</strong></p><p>Upon booking you will receive an online intake form to fill out prior to your first visit. On your first visit we will go over the intake form together and create a customized plan for your session(s) based on your needs and goals.</p><p>Each session is custom to your needs, but in general, our session(s) include intention setting, breathwork, as well as, crystal bowl sound healing for balance and integration.</p><p>Wear comfortable clothes that allow for movement. We have the option of practicing 1:1 in my office or at the Fletchers Cove park moments away from the office.</p><p>After the session, you can expect to feel clear, balanced, and more invigorated. Allow time to rest and integrate after the session.</p></div>"
    }
]